erp3l/src/Documents/УстановкаКредитныхРейтингов/УстановкаКредитныхРейтингов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаКредитныхРейтингов</name>
  <registerRecords>InformationRegister.КредитныеРейтингиКонтрагентов</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ШкалаКредитногоРейтинга</name>
    <type>
      <types>CatalogRef.ШкалыКредитногоРейтинга</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Рейтинг</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>КредитныйРейтинг</name>
      <type>
        <types>CatalogRef.КредитныеРейтинги</types>
      </type>
    </attributes>
    <attributes>
      <name>Прогноз</name>
      <type>
        <types>EnumRef.ПрогнозКредитногоРейтинга</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

erp3l/src/Documents/УстановкаКредитныхРейтингов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.КредитныеРейтингиКонтрагентов.Записывать = Истина;
	Для Каждого ТекСтрокаРейтинг Из Рейтинг Цикл
		Движение = Движения.КредитныеРейтингиКонтрагентов.Добавить();
		Движение.Период = Дата;
		Движение.Контрагент = ТекСтрокаРейтинг.Контрагент;
		Движение.ШкалаКредитногоРейтинга = ШкалаКредитногоРейтинга;
		Движение.КредитныйРейтинг = ТекСтрокаРейтинг.КредитныйРейтинг;
		Движение.Прогноз = ТекСтрокаРейтинг.Прогноз;
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Дата = ТекущаяДатаСеанса();
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

#КонецЕсли
